/*
Во всех заданиях необходимо предусмотреть проверку на
правильность вводимых данных с клавиатуры;
Каждое задание на функции должно сопровождаться
минимум тремя тестами;
ЗАПРЕЩЕНО использовать рекурсию.
*/
import 'dart:io';
import 'package:chapter_2/shared.dart';

var task = Task("""
1. Пользователь вводит с клавиатуры целочисленный список. Напишите
функцию, которая возвращает его максимальное значение. Полученный
результат выведите в терминал.
""", execute);

void execute(List<String> arguments) {
  stdout.write("");
}
