/*
Во всех заданиях необходимо предусмотреть проверку на
правильность вводимых данных с клавиатуры.
Каждое задание на функции должно сопровождаться
минимум тремя тестами.
*/
import 'dart:io';
import 'package:chapter_2/shared.dart';

var task = Task("""
1. Напишите функцию, на вход которой подается целочисленное
значение, устанавливающее начальное состояние счетчика. Она должна
возвращать другую функцию, при вызове которой будет возвращаться
обновленное значение счетчика, увеличивающееся на единицу.
Полученный результат выведите в терминал.
""", execute);

void execute(List<String> arguments) {
  stdout.write("");
}
